Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཀྱིས་ཤར་ཕྱོགས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མཐོང་ངམ། དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་།
en: The Blessed One continued, “Monks, do you see to the east all the countless, immeasurable blessed buddhas about to awaken to unsurpassed, completely perfect awakening?

source: ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། ཕྱོགས་མཚམས་རྣམས་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དག་མཐོང་ངམ།
en: Monks, in the south, the west, and the north, in the intermediate directions, and below and above, do you see countless, immeasurable blessed buddhas about to awaken to unsurpassed, completely perfect awakening?”

source: དེ་དག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་ཏེ།
en: “Yes indeed, Blessed One,” they replied.

source: བགྲང་བའི་ཚུལ་གྱིས་མཐོང་ལགས་ཀྱི་དོན་དམ་པར་ནི་མ་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “We see in our limited way.

source: དགེ་སློང་དག་འདི་ལྟ་སྟེ།
en: We cannot see in the ultimate way.”

source: དཔེར་ན་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཆུའི་ཕུང་པོ་ནས་བཟུང་སྟེ། ཚངས་པའི་འཇིག་རྟེན་གྱི་མཐར་ཐུག་པའི་བར་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གྱིས་ཡོངས་སུ་གང་བར་གྱུར་ན། དགེ་སློང་དག་འདི་ཇི་སྙམ་དུ་སེམས། །རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་དག་ཚད་བཟུང་བའམ། བགྲང་བའམ། དཔེའམ། ཡོངས་སུ་བགྲང་བར་ནུས་སྙམ་མམ།
en: The Blessed One continued, “Monks, it is like this; consider this analogy: if you were to fill the space from the ocean that surrounds the four great continents of this world to the upper limit of the Brahmā realms with the tiniest particles, do you think it would be possible to measure those particles, to count them, to approximate them, or to precisely quantify them?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཀའ་སྩལ་པ།
en: “No Blessed One,” they replied.

source: དགེ་སློང་དག་འདི་ལྟ་སྟེ། དཔེར་ན་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ལྟ་བུའི་བྱེ་བ་ཕྲག་འབུམ་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གྱིས་ཡོངས་སུ་གང་བར་གྱུར་ན། དགེ་སློང་དག་ངས་ཤའི་སྤྱན་ཐ་མལ་པས་ཤར་ཕྱོགས་སུ་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་གཟིགས་ཏེ།
en: He continued, “Monks, it is so: if, to give an analogy, a world such as this with its four great continents were entirely filled with tiny particles, that is how many blessed buddhas I see to the east when I look with my ordinary eye of flesh.

source: དཔེར་ན་གཉའ་ཤིང་གང་ཙམ་ན་འདུག་པ། རྣམ་པར་མི་རྟོག་པ། ཤའི་མིག་མ་ཉམས་པ། རྒྱང་རིང་པོར་མི་ལྟ་བའི་རང་གི་ཡུལ་བཞིན་ནོ། །
en: It is like, for example, seeing something up close, just a yoke away, without conceptual thought, not seen from afar but directly, with unimpaired eyes.

source: ལྷོ་ཕྱོགས་སུ་ཡང་དེ་བཞིན། ནུབ་ཕྱོགས་སུ་ཡང་དེ་བཞིན། བྱང་ཕྱོགས་སུ་ཡང་དེ་བཞིན། ཕྱོགས་མཚམས་རྣམས་སུ་ཡང་དེ་བཞིན། འོག་གི་ཕྱོགས་སུ་ཡང་དེ་བཞིན། སྟེང་གི་ཕྱོགས་སུ་དེ་བཞིན་ནོ། །
en: So too in the south, in the west, in the north, in the intermediate directions, and below and above.

source: དགེ་སློང་དག་ངས་འདི་ལྟ་སྟེ། དཔེར་ན་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འབུམ་ཆུའི་ཕུང་པོ་ནས་བཟུང་སྟེ། ཚངས་པའི་འཇིག་རྟེན་གྱི་མཐར་ཐུག་པའི་བར་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གྱིས་ཡོངས་སུ་གང་བར་གྱུར་པའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་ཤར་ཕྱོགས་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པ་དང་། བཞུགས་པར་གྱུར་པ་དག་ཀྱང་གཟིགས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱང་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་མཚན་འཐུན་པ་ཤ་སྟག་ཡིན་ནོ། །དེ་བཞིན་དུ་མར་མེ་མཛད་ཅེས་བྱ་བར་མཚན་འཐུན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། དེ་བཞིན་དུ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་རུ་ཅེས་བྱ་བར་མཚན་འཐུན་པ་དང་། དེ་བཞིན་དུ་པད་མ་དམ་པ་ཞེས་བྱ་བར་མཚན་འཐུན་པ་དང་།
en: “Indeed monks, it is so: to the east I see blessed buddhas as numerous as the tiny particles it would take to completely fill a hundred thousand worlds from the oceans that surround the four great continents to the upper limits of the Brahmā realms—those who are about to sit and those who are seated at the seat of awakening, all of whom are none other than blessed buddhas who bear the name Śākyamuni.

source: དེ་བཞིན་དུ་མངོན་པར་འཕགས་པར་གཤེགས་པ་ཞེས་བྱ་བར་མཚན་འཐུན་པ་དང་། དེ་བཞིན་དུ་གྲགས་མཆོག་ཅེས་བྱ་བར་མཚན་འཐུན་པ་དང་། དེ་བཞིན་དུ་འཁོར་བ་འཇིག་ཅེས་བྱ་བར་མཚན་འཐུན་པ་དང་། དེ་བཞིན་དུ་གསེར་ཐུབ་ཅེས་བྱ་བར་མཚན་འཐུན་པ་དང་། དེ་བཞིན་དུ་འོད་སྲུང་ཞེས་བྱ་བར་མཚན་འཐུན་པ་ཤ་སྟག་ལ་ཡང་དེ་སྙེད་གཟིགས་སོ། །
en: Likewise, I see as many blessed buddhas who bear the name Dīpaṅkara, who bear the name Sarvābhibhū, who bear the name Padmottama, who bear the name Atyuccagāmin, who bear the name Yaśottara, who bear the name Krakucchanda, who bear the name Kanakamuni, and who bear the name Kāśyapa.

source: དེ་བཞིན་དུ་མཚན་གཞན་དང་། གཞན་དུ་གསོལ་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་གཟིགས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་དེ་དག་ཀྱང་འཇིག་རྟེན་ན་ཆོས་རྒྱ་ཆེན་པོ་དང་། ཆོས་སྣ་ཚོགས་དང་། ཆོས་མཆོག་དང་ལྡན་པའི་ལས་ཅན་དག་ཡིན་ཏེ།
en: “Likewise, I also see blessed buddhas known by a variety of other names, active in this world with the Dharma that is vast, diverse, and supreme.

source: དེ་ལྟར་མཚན་ཐ་དད་པར་གསོལ་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དག་ཀྱང་གཟིགས་སོ། །
en: I see blessed buddhas known by different names living and thriving now.

source: མཚན་དེ་ལྟ་བུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དག་དང་། བཞུགས་པ་དག་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དག་ཀྱང་གཟིགས་ཏེ།
en: I see blessed buddhas with such names who are yet to pass into parinirvāṇa, who are still living, turning the wheel of Dharma.

source: ངའི་ཤའི་སྤྱན་ཐ་མལ་པ་བསྒྲིབས་པ་མེད་པ། ཐོགས་པ་མེད་པ་ཆགས་པ་མེད་པའི་ཡུལ་དུ་སྣང་བ་ནི་དེ་དག་ཡིན་ཏེ།
en: They all clearly appear to my unobscured, unimpeded, and unattached ordinary eye of flesh.

source: དེ་བཞིན་གཤེགས་པས་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: This is how the Thus-Gone One knows.

source: དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་པ་གང་ཡིན་པ་ནི་དེ་བས་ཀྱང་ལྷག་པ་དང་། ལྷག་པ་བས་ཀྱང་ལྷག་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཆེས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: But the Thus-Gone One knows more, much more than that—what he knows is inconceivable, inconceivably greater than that.

source: གོང་མ་དང་། ཆེས་གོང་མ་དང་། ཚད་མེད་པ་དང་། ཆེས་ཚད་མེད་པ་དག་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: It is superior, far superior to that; it is unfathomable, unfathomably greater than that.

source: ཤའི་སྤྱན་ཐ་མལ་པས་ཀྱང་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ་དང་། དེ་ལྟར་གཞལ་དུ་མེད་པ་དང་། དེ་ལྟར་བགྲང་དུ་མེད་པ་དང་། དེ་ལྟར་གྲངས་མེད་པ་ཡིན་ན། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “With my ordinary eye of flesh, I see that the number of thus-gone ones is immeasurable, infinite, unfathomable, and uncountable, not to mention the qualities of those buddhas.

source: དགེ་སློང་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ཁྱིམ་པའམ་རབ་ཏུ་བྱུང་བ་གང་ལ་ལ་ཞིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་ཐོབ་པར་གྱུར་པ་དེ་དག་ལ་བསྐལ་པ་ཡོངས་སུ་རྫོགས་པར་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པར་བྱས། རྗེད་པར་བྱས།
en: “Monks, it is so: for comparison, consider householders or renunciates who for an entire eon have venerated, served, honored, worshiped, revered, supplicated, and made inconceivable quantities of various offerings to perfect buddhas as numerous as all the beings in this buddha field who have reached unsurpassed, completely perfect awakening and developed the ten powers and the fearlessnesses.

source: གསོལ་བར་བྱས་ཏེ། མཆོད་པ་སྣ་ཚོགས་བསམ་གྱིས་མི་ཁྱབ་པ་དག་གིས་མཆོད་པ་བྱས་པ་བས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་སངས་རྒྱས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་དད་པའི་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་སྐྱེད་ཅིང་ཐེ་ཙོམ་མེད་པའི་བློས་ཡང་དག་པའི་འདུ་ཤེས་བསྐྱེད་པར་གྱུར་ན། སེམས་བསྐྱེད་མ་ཐག་ཏུ་དེ་བས་ཆེས་བསོད་ནམས་མང་དུ་སྐྱེ་བར་འགྱུར་ཞིང་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་མང་པོ་དག་དང་ཡང་ཉེ་བར་འགྱུར་གྱི།
en: Compared to them, a noble son or noble daughter who develops faith, even for an instant, in this Dharma teaching as discerned and taught by all the buddhas, and who with a mind free of doubt develops the right understanding of it will, as soon as this is developed, produce a much greater amount of merit and will come closer to the many buddha qualities.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་གྱུར་པ་ལ་བསྐལ་པར་བསྙེན་བཀུར་བྱས་པས་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །
en: Even if all the beings of this great trichiliocosm spent an eon revering those who have attained omniscience, they would not generate as much merit.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཞིག་ཡེ་ཤེས་འདི་ལ་མོས་པར་བྱེད་པ་དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ཉེ་བར་འགྱུར་ཞིང་། དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་ཡང་ཉེ་བར་འགྱུར་རོ། །
en: Any bodhisattva great being who cultivates devoted interest in this wisdom will not only come closer to the blessed buddhas, but they will also come closer to unsurpassed, completely perfect awakening.”

source: ཤའི་སྤྱན་བཤད་པ་ལུང་བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་གཉིས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་འབྱུང་བར་དཀའ་བ་ཡིན་གྱིས།
en: When this prophetic discourse concerning his eye of flesh was given, six hundred twenty million beings generated the mind set on unsurpassed, completely perfect awakening.

source: བདག་ཅག་གིས་འདི་ཉིད་ལ་སྡུག་བསྔལ་ཟད་པ་དང་། ཉོན་མོངས་པའི་མཐའ་མ་དང་། ཟག་པ་ཟད་པ་ཐོབ་པར་བྱའོ་སྙམ་ནས་ཡང་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: They thought, “Though it is difficult to reach unsurpassed, completely perfect awakening, with this our sufferings are over, our afflictions are ended, and we will achieve the exhaustion of the defilements,” and reached the stage of irreversibility.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ནི་སློབ་པའི་ས་ལ་བཀོད་པར་གྱུར་ཏོ། །
en: Innumerable beings were established at the level of training.

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་ནི་སེམས་དང་པོ་བསྐྱེད་པས་ཡོངས་སུ་གྲུབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Ten billion bodhisattvas, by generating the mind set on awakening for the first time, became fully accomplished, and thirty-two trillion bodhisattvas reached acceptance of the unborn nature of phenomena.

source: དེ་ནས་བདུད་སྡིག་ཅན་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་བར་གྱུར་ཏེ།
en: Then wicked Māra became dispirited and distressed.

source: མཆི་མས་བརྣངས་ཤིང་ངུ་བཞིན་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་སེམས་ཅན་རྣམས་བདག་གི་ཡུལ་ལས་ཡང་དག་པར་འདའ་བར་མ་གྱུར་ཅིག་སྙམ་ནས།
en: Weeping and choked with tears, he complained to the Blessed One, “Blessed One, I do not want beings to ever escape my grasp.

source: གང་གི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འཚལ་བ་དེ་ཉིད་བཅོམ་ལྡན་འདས་ཉམས་པ་མི་མངའ་བས་སྐུ་ཚེའི་ཚད་བསྐལ་པར་བཞུགས་པ་དང་འདྲ་བར་སྐྱ་རེངས་མ་ཤར་ཅིང་གདུགས་མ་བདལ་བར་ཡང་སེམས་ཅན་ཚད་མ་མཆིས་པ་རྣམས་ཀྱི་དོན་གྱི་སླད་དུ་འདི་ལྟ་སྟེ།
en: Thus-gone, worthy, perfect Buddha, you wish to pass into parinirvāṇa for their sake.

source: མྱ་ངན་ལས་འདའ་བ་ལ་རབ་ཏུ་བཀོད་ལགས་པས།
en: You never diminish, so you have a lifespan that lets you remain for eons, yet before dawn, before sunlight spreads across the land, you will have established countless beings in nirvāṇa.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་བདག་གི་ཡུལ་སྟོངས་པར་མཛད་ལགས་སོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Blessed Thus-Gone One, you will empty my domain!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྡིག་ཅན་སེམས་ཅན་གང་དག་དགེ་བའི་ཆོས་རྣམས་ལ་མངོན་པར་མི་བརྩོན་པ་དང་། གང་དག་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་དད་པར་མི་བྱེད་པ་དེ་དག་ཁྱོད་ཀྱི་གྲོགས་ཡིན་ལ།
en: The Blessed One replied to wicked Māra, “Wicked one, those who do not fully strive for virtuous qualities and those who do not cultivate faith in the domain of the Thus-Gone One will be your companions, and you, too, will be their companion.

source: ཁྱོད་ཀྱང་དེ་དག་གི་གྲོགས་ཡིན་པས་སྡིག་ཅན་ཁྱོད་ཀྱི་གྲོགས་མང་དུ་ཡོད་ཀྱིས།
en: You will have many to keep you company, so do not weep!

source: སྡིག་ཅན་ངུ་བར་མ་བྱེད་སྨྲེ་སྔགས་མ་འདོན་ཅིག །
en: Wicked one, stop wailing!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཕྱག་གིས་སེན་མོའི་རྩེ་མོས་ས་གཞི་ཆེན་པོ་ལས་སའི་རྡུལ་ཞིག་བླངས་ནས་བདུད་སྡིག་ཅན་ལ་བཀའ་སྩལ་པ། སྡིག་ཅན་འདི་ཇི་སྙམ་དུ་སེམས།
en: The Blessed One then reached down to the ground, and picking up some dust with the tip of his fingernail, he asked wicked Māra, “Wicked one, what do you think?

source: ཅི་སེན་མོའི་རྩེ་མོ་ལ་རྟེན་པ་དང་ས་གཞི་ཆེན་པོ་ལ་རྟེན་པའི་རྡུལ་གང་ཡིན་པ་དེ་གཉིས་གང་མང་སྙམ་སེམས། དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། །
en: Is there more dust on the tip of my fingernail or covering this vast earth?”

source: བཅོམ་ལྡན་འདས་ལ་བདུད་སྡིག་ཅན་གྱིས་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་གི་སེན་མོའི་རྩེ་མོ་ལ་མཆིས་པའི་དོག་སའི་རྡུལ་ནི་ཉུང་གི་ས་གཞི་ཆེན་པོ་ལ་མཆིས་པ་ནི་ཤིན་ཏུ་མང་ལགས་སོ། །
en: “Blessed One, there is less dust on the tip of your fingernail, and much more covering this vast earth!”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: replied the wicked one.

source: སྡིག་ཅན་འདི་ལྟ་སྟེ་དཔེར་ན་ངའི་སེན་མོའི་རྩེ་མོ་ལ་འདུག་པའི་རྡུལ་བས་ཀྱང་ཆེས་ཉུང་བའི་སེམས་ཅན་དག་ངས་ཉོན་མོངས་པ་ཟད་པར་བྱས་ཏེ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་བླ་ན་མེད་པ་ལ་སོ་སོར་བཀོད་ཀྱི།
en: The Blessed One then said to wicked Māra, “Wicked one, as in this analogy, the sentient beings whose afflictions I have exhausted and established individually in unsurpassable parinirvāṇa are far fewer than the particles of dust on the tip of my fingernail, and as in this analogy, wicked one, beings far more numerous than the particles of dust covering this vast earth have gone to your domain.

source: སྡིག་ཅན་འདི་ལྟ་སྟེ་དཔེར་ན་ས་གཞི་ཆེན་པོ་ལ་རྟེན་པའི་རྡུལ་བས་ཀྱང་ཆེས་མང་བའི་སེམས་ཅན་རྣམས་ནི་ཁྱོད་ཀྱི་ཡུལ་དུ་སོང་བས་ན་སེམས་ཅན་གྱི་ཁམས་དཔག་ཏུ་མེད་པར་ཡོད་ཀྱིས་སྡིག་ཅན་ཁྱོད་དགའ་བར་གྱིས་ཤིག །
en: So, since the realms of beings are limitless, you should be happy, wicked one!

source: སྡིག་ཅན་དེ་ལྟ་མོད་ཀྱི་སེམས་ཅན་རྣམས་ནི་བདག་ཉིད་ཀྱིས་བདག་ཉིད་ཇི་ལྟར་རིང་བར་འགྱུར་བ་དེ་ལྟར་བྱེད་པས་ན་དེ་རྣམས་ལ་ཁྱོད་ཀྱིས་ཀྱང་ཅི་ཞིག་བྱར་ཡོད།
en: Indeed, wicked one, how long such beings remain depends on what they themselves do; there is nothing even you can do about it.

source: སྡིག་ཅན་དེ་ལྟར་ན་སེམས་ཅན་གྱི་ཁམས་དཔག་ཏུ་མེད་པར་ཡོད་ཀྱིས་དེ་དག་ལ་བྱ་བ་གང་ཡོད་པ་དེ་གྱིས་ཤིག །
en: So, wicked one, since there are countless realms of beings like this, do what you will with them!

source: དེ་བཞིན་གཤེགས་པ་ནི་དོ་མོད་ནམ་གྱི་ཐུན་ཐ་མ་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: The Thus-Gone One will pass into parinirvāṇa during the last watch of this night.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་མཐོང་ངམ། གསོལ་པ།
en: The Blessed One then asked the monks, “Monks, do you see the blessed buddhas?”

source: བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །བཀའ་སྩལ་པ། །
en: “Yes indeed, Blessed One,” they replied.

source: དེ་བས་ཀྱང་ཤིན་ཏུ་ཚད་མེད་པ་དག་ཡོད་པར་བལྟའོ། །
en: The Blessed One said, “Even more than this, you will see that they are utterly limitless.

source: དེ་བཞིན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཕུན་སུམ་ཚོགས་པ་དག་མཐོང་ངམ།
en: Do you also see the world systems of the blessed buddhas and their wondrous buddha fields?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་བཀོད་པ་དང་། ཉན་ཐོས་རྣམས་ཀྱི་ཉན་ཐོས་ཀྱི་ཕུན་སུམ་ཚོགས་པ་དག་མཐོང་ངམ། །དེ་དག་གིས་གསོལ་པ།
en: Do you see the great arrays of the bodhisattvas and the excellences of the hearers?”

source: བདེ་བར་གཤེགས་པ་དེ་དེ་ལྟ་ལགས་སོ། །བཀའ་སྩལ་པ།
en: Yes indeed, Well-Gone One,” they replied.

source: དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པས་ནི་དེ་བས་ཀྱང་ཕྱིར་ཞིང་ལྷག་པ་དང་། ཤིན་ཏུ་ཚད་མེད་པ་དག་ཀྱང་རབ་ཏུ་མཁྱེན་ཏེ།
en: The Blessed One continued, “Monks, the knowledge of the Thus-Gone One extends even beyond that; his knowledge is utterly infinite.

source: དགེ་སློང་དག་ངས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པའི་ཕུན་སུམ་ཚོགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཕུན་སུམ་ཚོགས་པ་དེ་ལྟ་བུ་དག་མཐོང་བ་ནི་ངས་བསྐལ་པའམ། བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་འབུམ་འམ། བསྐལ་པ་བྱེ་བའམ། བསྐལ་པ་ཁྲག་ཁྲིག་གམ། དེ་བས་ཀྱང་ལྷག་པ་དེ་སྙེད་དུ་དཔེས་རབ་ཏུ་ཕྱེ་སྟེ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བརྗོད་ཀྱང་མཐར་ཐུག་པར་འགྱུར་བ་མེད་དོ། །
en: Monks, the abundance of thus-gone ones and the abundance of buddha fields I see in world systems in the ten directions are so numerous that even if I were to spend an eon, a hundred eons, a thousand eons, a hundred thousand eons, ten million eons, a billion eons, or more describing them thoroughly and in great detail and with analogies, the task would still be incomplete.

source: དགེ་སློང་དག་ངས་ཁྱེད་ཅག་ཉན་ཐོས་རྣམས་ལ་སྟོན་པའི་བྱ་བ་གང་ཡིན་པ་དེ་ཡང་བྱས་ཏེ་ངས་ཆོས་ལ་སློབ་དཔོན་གྱི་དཔེ་མཁྱུད་མ་བྱས་པར་ཕྱི་ནང་མེད་པར་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་བསྟན་ཟིན་ཏེ།
en: Monks, what I have to teach you, my disciples, I have already taught. I have held nothing back. I have taught you the entirety of the Dharma in all its aspects, inside and out.

source: དེ་ལས་ལྷག་པར་ཐོབ་པར་བྱ་བ་ནི་ཐ་ན་རྩྭའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་ཡང་མེད་ཀྱིས་ད་ཁྱེད་ཅག་གིས་ནན་ཏན་ལ་གནས་པར་བྱའོ། །
en: There is not even the tip of a blade of grass worth of teachings you have yet to receive, so now it is up to you to be diligent!

source: ངས་ཁྱེད་ཅག་ལ་མྱ་ངན་ལས་འདའ་བའི་ཆོས་ཀྱང་བསྟན། མྱ་ངན་ལས་འདའ་བར་འགྲོ་བའི་ལམ་ཡང་བསྟན། སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་དཀའ་བདག་ཀྱང་ཡང་དག་པར་བསྐྱེད།
en: I have taught you the Dharma of nirvāṇa, I have shown you the path that leads beyond suffering, I have produced roots of virtue that are extremely hard for beings to produce, and I have achieved unsurpassed, completely perfect awakening.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཡང་དག་པར་བསྒྲུབས་ཟིན་གྱིས་དེ་བཞིན་དུ་ཐམས་ཅད་རྗེས་སུ་ཡོངས་སུ་ཟུང་ལ་ཅི་ནས་ཀྱང་ཉམས་པར་མི་འགྱུར་བ་དེ་ལྟར་གྱིས་ཤིག །
en: Now you must all do likewise and under no circumstances let the teachings be spoiled!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་མཛད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་མཛད་པས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ཏུ་ཆོས་བསྟན་པ་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ཐོས་པར་གྱུར་ཏེ།
en: The Blessed One then performed a miracle such that by the performance of this miracle the Dharma being taught by blessed buddhas in world systems in the ten directions could be heard by the beings in this buddha field.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་གང་དག་བསྟན་པའི་ཆོས་དེ་དག་སྟོན་ཅིང་ཆོས་དེ་དག་ཀུན་ཏུ་ཤེས་པར་གྱུར་པའི་སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ནི་ཐེག་པ་གསུམ་ལ་རབ་ཏུ་བཀོད་པར་གྱུར་ཏོ། །བྱེ་བ་འབུམ་ཕྲག་བཅུ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་པར་གྱུར་ཏོ། །སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བཅུ་ནི་རང་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་པར་གྱུར་ཏོ། །སེམས་ཅན་དེ་བས་ལྷག་པ་རྣམས་ནི་ཟག་པ་ཟད་པ་ལ་གནས་པར་གྱུར་ཏོ། །
en: Those beings as numerous as the grains of sand in the river Gaṅgā who fully understood the Dharma taught by those blessed buddhas were firmly established in the three vehicles; ten trillion were firmly established in the state of unsurpassed, completely perfect awakening; ten billion beings were established in solitary awakening; and an even greater number reached the state in which defilements are exhausted.

source: དེ་ལྟར་ཆོས་བསྟན་པ་འདིས་སེམས་ཅན་ཁྲག་ཁྲིག་ཕྲག་ཚད་མེད་དཔག་ཏུ་མེད། བགྲང་དུ་མེད། གཞལ་དུ་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམས་ཀྱི་དོན་བྱས་པར་གྱུར་ཏོ། །
en: The teachings likewise benefited immeasurable, uncountable, infinite, and inconceivable billions of other beings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ད་ནི་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་ཡིས་ཁྱེད་ཀྱིས་ཅི་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ཀུན་ཏུ་བསྲུང་བ་ལ་ནན་ཏན་གྱིས་ཤིག །
en: The Blessed One then said to the monks, “Monks, I will now pass into parinirvāṇa. Henceforth, you must do whatever you can to protect the teachings of the Buddha.

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་བདག་ལ་ཕན་པ་དང་། གཞན་ལ་ཕན་པའི་ཕྱིར་དེ་ལྟར་བསླབ་པར་བྱའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་།
en: Monks, in order to take care of yourselves and benefit others, you must train in this way.”

source: ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: When the Blessed One had finished speaking, Venerable Ānanda and the world with its gods, humans, asuras, and gandharvas rejoiced and praised what the Blessed One had said.

source: འཕགས་པ་ཁྱེའུ་བཞིའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Mahāyāna sūtra “The Four Boys’ Absorption.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། པྲ་ཛྙཱ་བརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།​། །​།
en: Translated, edited, and finalized by the Indian scholars Jinamitra and Prajñāvarman, the translator-editor Bandé Yeshé Dé, and others.
